app/views/posts/index.html.haml

SELECT COUNT(*) FROM "subscribes" WHERE "subscribes"."community_id" = $1  [["community_id", 2]]
---
            %br
            %small #{community.subscribes.count}  subscribers
          .community__button.ml-auto