app/controllers/communities_controller.rb

  def create
    @community = Community.new(communities_params)
    if @community.save
---
INSERT INTO "communities" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "other community"], ["created_at", "2018-10-07 16:32:56.303160"], ["updated_at", "2018-10-07 16:32:56.303160"]]

  def set_community
    @community = Community.find(params[:id])
---
SELECT  "communities".* FROM "communities" WHERE "communities"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]