app/controllers/comments_controller.rb

  def create
    @comment = @commentable.comments.new(comments_params)
    @comment.user = current_user
    if @comment.save
---
INSERT INTO "comments" ("body", "user_id", "commentable_type", "commentable_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["body", "dsadasd"], ["user_id", 1], ["commentable_type", "Post"], ["commentable_id", 1], ["created_at", "2018-09-28 21:05:41.254648"], ["updated_at", "2018-09-28 21:05:41.254648"]]

  def find_commentable
    @commentable = Comment.find(params[:comment_id]) if params[:comment_id]
    @commentable = Post.find(params[:post_id]) if params[:post_id]
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]