app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "body", "user_id", "created_at", "updated_at", "image", "community_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["title", "asdada"], ["body", ""], ["user_id", 1], ["created_at", "2018-10-07 16:33:14.435552"], ["updated_at", "2018-10-07 16:33:14.435552"], ["image", "something.jpg"], ["community_id", 3]]
---
  def create
    @post = current_user.posts.new(post_params)

    respond_to do |format|
      if @post.save