app/controllers/subscribes_controller.rb

  def create
    @subscribe = current_user.subscribes.new(community_id: params[:community_id])
      if @subscribe.save
---
INSERT INTO "subscribes" ("user_id", "community_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["community_id", 1], ["created_at", "2018-09-30 19:17:46.613755"], ["updated_at", "2018-09-30 19:17:46.613755"]]