app/views/communities/show.html.haml

SELECT "posts".* FROM "posts" WHERE "posts"."community_id" = $1 ORDER BY "posts"."created_at" DESC  [["community_id", 3]]
SELECT  1 AS one FROM "posts" WHERE "posts"."community_id" = $1 LIMIT $2  [["community_id", 3], ["LIMIT", 1]]
---
- if @community.posts.any?
  -@community.posts.each do |post|
    .post.d-flex.flex-row-reverse.mb-3.justify-content-end
      .post__container.d-flex.flex-column.px-2
        .post__header

SELECT COUNT(*) FROM "subscribes" WHERE "subscribes"."community_id" = $1  [["community_id", 3]]
---
        .information__subcribes.d-flex.flex-column
          = @community.subscribes.count

SELECT COUNT(*) FROM "posts" WHERE "posts"."community_id" = $1  [["community_id", 3]]
---
        .information__posts.d-flex.flex-column
          = @community.posts.count